Repository: CofficLab/GitOK
Catalog: Plugins/IconPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant, zh_hk

# add-icon-button
source: Add Icon…
zh_hans: 添加图标…
zh_hant: 添加图标…
zh_hk: 添加圖示…

# add-image-button
source: Add Image
zh_hans: 添加图片
zh_hant: 添加图片
zh_hk: 添加圖片

# adjust-colors-style
source: Adjust colors and styles
zh_hans: 调整颜色和样式
zh_hant: 调整颜色和样式
zh_hk: 調整顏色和樣式

source: Both Xcode icon set formats saved to Downloads
zh_hans: Xcode 图标集两种格式已保存到下载
zh_hant: Xcode 圖示集兩種格式已儲存至下載
zh_hk: Xcode 圖示集兩種格式已儲存至下載

# delete-icon-button
source: Delete Icon…
zh_hans: 删除图标…
zh_hant: 删除图标…
zh_hk: 刪除圖示…

# delete-selected-button
source: Delete Selected
zh_hans: 删除所选
zh_hant: 删除所选
zh_hk: 刪除所選

source: Download Xcode Format
zh_hans: 下载 Xcode 格式
zh_hant: 下載 Xcode 格式
zh_hk: 下載 Xcode 格式

source: Draft
zh_hans: 草稿
zh_hant: 草稿
zh_hk: 草稿

source: Edit
zh_hans: 编辑
zh_hant: 编辑
zh_hk: 編輯

source: Export
zh_hans: 导出
zh_hant: 导出
zh_hk: 匯出

source: Generating Xcode Icon Set...
zh_hans: 正在生成 Xcode 图标集...
zh_hant: 正在產生 Xcode 圖示集...
zh_hk: 正在產生 Xcode 圖示集...

# icon-count
source: %lld Icons
zh_hans: %lld 个图标
zh_hant: %lld 个图标
zh_hk: %lld 個圖示

source: Icon not found: %@
zh_hans: 未找到图标：%@
zh_hant: 未找到图标：%@
zh_hk: 未找到圖示：%@

source: Icon Workshop
zh_hans: 图标制作工坊
zh_hant: 图标制作工坊
zh_hk: 圖示製作工坊

# load-icon-failed
source: Failed to load icon: %@
zh_hans: 加载图标失败：%@
zh_hant: 加载图标失败：%@
zh_hk: 載入圖示失敗：%@

source: Loading categories…
zh_hans: 加载分类中...
zh_hant: 加载分类中...
zh_hk: 載入分類中...

source: Loading failed
zh_hans: 加载失败
zh_hant: 加载失败
zh_hk: 載入失敗

source: Loading icons…
zh_hans: 加载图标中...
zh_hant: 加载图标中...
zh_hk: 載入圖示中...

# multiple-formats
source: Download in multiple formats
zh_hans: 多种格式下载
zh_hant: 多种格式下载
zh_hk: 多種格式下載

source: No access to downloads folder
zh_hans: 无法访问下载文件夹
zh_hant: 無法存取下載資料夾
zh_hk: 無法存取下載資料夾

source: No available icon assets
zh_hans: 没有可用的图标资源
zh_hant: 沒有可用的圖示資源
zh_hk: 沒有可用的圖示資源

source: No available icon data
zh_hans: 没有可用的图标数据
zh_hant: 沒有可用的圖示資料
zh_hk: 沒有可用的圖示資料

source: No categories available
zh_hans: 没有可用的分类
zh_hant: 没有可用的分类
zh_hk: 沒有可用的分類

# no-icons-in-source
source: No icons available in this source
zh_hans: 该来源下没有可用的图标
zh_hant: 该来源下没有可用的图标
zh_hk: 該來源下沒有可用的圖示

# no-matching-categories
source: No matching categories found
zh_hans: 没有找到匹配的分类
zh_hant: 没有找到匹配的分类
zh_hk: 沒有找到匹配的分類

source: Open Cache Directory
zh_hans: 打开缓存目录
zh_hant: 打开缓存目录
zh_hk: 打開快取目錄

# plugin-description
source: Manage and customize app icons
zh_hans: 管理和自定义应用图标
zh_hant: 管理和自訂應用圖示
zh_hk: 管理和自訂應用圖示

# plugin-display-name
source: Icon
zh_hans: 图标
zh_hant: 圖示
zh_hk: 圖示

source: Retry
zh_hans: 重试
zh_hant: 重试
zh_hk: 重試

# save-progress
source: Save work progress
zh_hans: 保存制作进度
zh_hant: 保存制作进度
zh_hk: 保存製作進度

source: Search categories…
zh_hans: 搜索分类...
zh_hant: 搜索分类...
zh_hk: 搜尋分類...

# select-category-prompt
source: Select a category
zh_hans: 请选择一个分类
zh_hant: 请选择一个分类
zh_hk: 請選擇一個分類

# select-icon-to-start
source: Select an icon to start crafting, or create a new design
zh_hans: 选择一个图标开始制作，或创建新的设计
zh_hant: 选择一个图标开始制作，或创建新的设计
zh_hk: 選擇一個圖示開始製作，或創建新的設計

# Xcode 16 格式会自动调整，Xcode 26 格式保持用户设置
source: Xcode 16 format auto-adjusts, Xcode 26 format keeps user settings
zh_hans: Xcode 16 格式会自动调整，Xcode 26 格式保持用户设置
zh_hant: Xcode 16 格式會自動調整，Xcode 26 格式保持使用者設定
zh_hk: Xcode 16 格式會自動調整，Xcode 26 格式保持用戶設定

# 内边距 %@
source: Padding %@
zh_hans: 内边距 %@
zh_hant: 內邊距 %@
zh_hk: 內邊距 %@

# 删除「%@」
source: Delete "%@"
zh_hans: 删除「%@」
zh_hant: 刪除「%@」
zh_hk: 刪除「%@」

# 图标工坊
source: Icon Workshop
zh_hans: 图标工坊
zh_hant: 圖示工坊
zh_hk: 圖示工坊

# 圆角 %lld
source: Corner Radius %lld
zh_hans: 圆角 %lld
zh_hant: 圓角 %lld
zh_hk: 圓角 %lld

# 在这里，您可以轻松为您的 macOS 和 iOS 应用创建精美的图标。
source: Here you can easily create beautiful icons for your macOS and iOS apps.
zh_hans: 在这里，您可以轻松为您的 macOS 和 iOS 应用创建精美的图标。
zh_hant: 在這裡，您可以輕鬆為您的 macOS 和 iOS 應用程式建立精美的圖示。
zh_hk: 在這裡，您可以輕鬆為您的 macOS 和 iOS 應用程式建立精美的圖示。

# 换图
source: Change Image
zh_hans: 换图
zh_hant: 更換圖片
zh_hk: 更換圖片

# 新建 Icon
source: New Icon
zh_hans: 新建 Icon
zh_hant: 新建 Icon
zh_hk: 新建 Icon

# 缩放 %@
source: Scale %@
zh_hans: 缩放 %@
zh_hant: 縮放 %@
zh_hk: 縮放 %@

# 背景透明度 %@
source: Background Opacity %@
zh_hans: 背景透明度 %@
zh_hant: 背景透明度 %@
zh_hk: 背景透明度 %@

# 请先选择一个图标
source: Please select an icon first
zh_hans: 请先选择一个图标
zh_hant: 請先選擇一個圖示
zh_hk: 請先選擇一個圖示

# 重试
source: Retry
zh_hans: 重试
zh_hant: 重試
zh_hk: 重試
